case/outputs_mitigated/openfoam_cases/section_2_x3p0km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 11.4611;

boundaryField
{
    inlet   { type fixedValue; value uniform 11.4611; }
    outlet  { type inletOutlet; inletValue uniform 11.4611; value uniform 11.4611; }
    walls   { type omegaWallFunction; value uniform 11.4611; }
}
