case/outputs_mitigated/openfoam_cases/section_2_x3p0km/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.liquid.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;
        MULESCorr       yes;
        nLimiterIter    5;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    "pcorr.*"        { solver PCG; preconditioner DIC; tolerance 1e-5; relTol 0; }
    p_rgh           { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0.05; }
    p_rghFinal      { $p_rgh; relTol 0; }
    U               { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-6; relTol 0; }
    "(k|omega).*"   { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0; }
}
PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
}
